In [13]:
import pandas as pd
pd.set_option("display.max_rows",500)
pd.set_option("display.max_columns",500)

In [3]:
df=pd.read_csv(r"C:\Users\RaghulRamesh\Downloads\18 - Day - 18 - Linear Regression Practise Python\18 - Day - 18 - Linear Regression Practise Python\company.csv")

In [4]:
df.head()

   Company   Age  Salary     Place
0      TCS  20.0     NaN   Chennai
1  Infosys  30.0     NaN    Mumbai
2      TCS  35.0  2300.0  Calcutta
3  Infosys  40.0  3000.0     Delhi
4      TCS  23.0  4000.0    Mumbai

In [5]:
df.tail()

     Company   Age  Salary     Place
143      TCS  33.0  9024.0  Calcutta
144  Infosys  22.0  8787.0  Calcutta
145  Infosys  44.0  4034.0     Delhi
146      TCS  33.0  5034.0    Mumbai
147  Infosys  22.0  8202.0    Cochin

In [6]:
df.head(10)

   Company   Age  Salary     Place
0      TCS  20.0     NaN   Chennai
1  Infosys  30.0     NaN    Mumbai
2      TCS  35.0  2300.0  Calcutta
3  Infosys  40.0  3000.0     Delhi
4      TCS  23.0  4000.0    Mumbai
5  Infosys   NaN  5000.0  Calcutta
6      TCS   NaN  6000.0   Chennai
7  Infosys  23.0  7000.0    Mumbai
8      TCS  34.0  8000.0  Calcutta
9      CTS  45.0  9000.0     Delhi

In [7]:
df.head(2)

   Company   Age  Salary    Place
0      TCS  20.0     NaN  Chennai
1  Infosys  30.0     NaN   Mumbai

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  140 non-null    object
 1   Age      130 non-null    float64
 2   Salary   124 non-null    float64
 3   Place    134 non-null    object
dtypes: float64(2), object(2)
memory usage: 4.8+ KB

In [9]:
df.describe()

              Age       Salary
count  130.000000   124.000000
mean    30.484615  5312.467742
std     11.096640  2573.764683
min      0.000000  1089.000000
25%     22.000000  3030.000000
50%     32.500000  5000.000000
75%     37.750000  8000.000000
max     54.000000  9876.000000

In [11]:
df.columns

Index(['Company', 'Age', 'Salary', 'Place'], dtype='object')

In [14]:
df["Company"]

0                            TCS
1                        Infosys
2                            TCS
3                        Infosys
4                            TCS
5                        Infosys
6                            TCS
7                        Infosys
8                            TCS
9                            CTS
10                           CTS
11                           CTS
12                           CTS
13                           CTS
14                       Infosys
15                           TCS
16                       Infosys
17                           TCS
18                           TCS
19                       Infosys
20                           TCS
21                       Infosys
22                           TCS
23                       Infosys
24                           TCS
25                       Infosys
26                           TCS
27                           CTS
28                           CTS
29                           CTS
30                           CTS
31                           CTS
32                       Infosys
33                           TCS
34                       Infosys
35                           TCS
36                           TCS
37                           NaN
38                           TCS
39                       Infosys
40                           TCS
41                       Infosys
42                           TCS
43                       Infosys
44                           TCS
45                           CTS
46                           CTS
47                           CTS
48                           CTS
49                           CTS
50                       Infosys
51                           NaN
52                       Infosys
53                           TCS
54                           TCS
55                       Infosys
56                           TCS
57                       Infosys
58                           TCS
59                       Infosys
60                           TCS
61                           NaN
62     Tata Consultancy Services
63                           CTS
64                           NaN
65                           CTS
66                           CTS
67                    Congnizant
68                       Infosys
69                           TCS
70               Infosys Pvt Lmt
71                           TCS
72                           TCS
73                       Infosys
74                           TCS
75                       Infosys
76                           TCS
77                       Infosys
78                           TCS
79                       Infosys
80                           TCS
81                           CTS
82                           CTS
83                           CTS
84                           CTS
85                           CTS
86                       Infosys
87                           TCS
88                       Infosys
89                           TCS
90                           TCS
91                       Infosys
92                           TCS
93                       Infosys
94                           TCS
95                       Infosys
96                           TCS
97                       Infosys
98                           TCS
99                           CTS
100                          CTS
101                          CTS
102                          CTS
103                          CTS
104                      Infosys
105                          TCS
106                      Infosys
107                          TCS
108                          TCS
109                          NaN
110                          TCS
111                      Infosys
112                          TCS
113                      Infosys
114                          TCS
115                      Infosys
116                          TCS
117                          CTS
118                          CTS
119                          CTS
120                          CTS
121                          CTS
122                      Infosys
123                          NaN
124                      Infosys
125                          TCS
126                          TCS
127                      Infosys
128                          TCS
129                      Infosys
130                          TCS
131                      Infosys
132                          TCS
133                          NaN
134    Tata Consultancy Services
135                          CTS
136                          NaN
137                          CTS
138                          CTS
139                   Congnizant
140                      Infosys
141                          TCS
142              Infosys Pvt Lmt
143                          TCS
144                      Infosys
145                      Infosys
146                          TCS
147                      Infosys
Name: Company, dtype: object

In [15]:
df['Company'].value_counts()

TCS                          53
Infosys                      45
CTS                          36
Tata Consultancy Services     2
Congnizant                    2
Infosys Pvt Lmt               2
Name: Company, dtype: int64

In [21]:
df['Company'].replace({'Tata Consultancy Services':'TCS','Infosys Pvt Lmt':'Infosys','Congnizant':'CTS'},inplace=True)

In [22]:
df['Company'].value_counts()

TCS        55
Infosys    47
CTS        38
Name: Company, dtype: int64

In [33]:
df['Company'].mode()[0]

'TCS'

In [35]:
df['Company'].fillna(df['Company'].mode()[0])

0          TCS
1      Infosys
2          TCS
3      Infosys
4          TCS
5      Infosys
6          TCS
7      Infosys
8          TCS
9          CTS
10         CTS
11         CTS
12         CTS
13         CTS
14     Infosys
15         TCS
16     Infosys
17         TCS
18         TCS
19     Infosys
20         TCS
21     Infosys
22         TCS
23     Infosys
24         TCS
25     Infosys
26         TCS
27         CTS
28         CTS
29         CTS
30         CTS
31         CTS
32     Infosys
33         TCS
34     Infosys
35         TCS
36         TCS
37         TCS
38         TCS
39     Infosys
40         TCS
41     Infosys
42         TCS
43     Infosys
44         TCS
45         CTS
46         CTS
47         CTS
48         CTS
49         CTS
50     Infosys
51         TCS
52     Infosys
53         TCS
54         TCS
55     Infosys
56         TCS
57     Infosys
58         TCS
59     Infosys
60         TCS
61         TCS
62         TCS
63         CTS
64         TCS
65         CTS
66         CTS
67         CTS
68     Infosys
69         TCS
70     Infosys
71         TCS
72         TCS
73     Infosys
74         TCS
75     Infosys
76         TCS
77     Infosys
78         TCS
79     Infosys
80         TCS
81         CTS
82         CTS
83         CTS
84         CTS
85         CTS
86     Infosys
87         TCS
88     Infosys
89         TCS
90         TCS
91     Infosys
92         TCS
93     Infosys
94         TCS
95     Infosys
96         TCS
97     Infosys
98         TCS
99         CTS
100        CTS
101        CTS
102        CTS
103        CTS
104    Infosys
105        TCS
106    Infosys
107        TCS
108        TCS
109        TCS
110        TCS
111    Infosys
112        TCS
113    Infosys
114        TCS
115    Infosys
116        TCS
117        CTS
118        CTS
119        CTS
120        CTS
121        CTS
122    Infosys
123        TCS
124    Infosys
125        TCS
126        TCS
127    Infosys
128        TCS
129    Infosys
130        TCS
131    Infosys
132        TCS
133        TCS
134        TCS
135        CTS
136        TCS
137        CTS
138        CTS
139        CTS
140    Infosys
141        TCS
142    Infosys
143        TCS
144    Infosys
145    Infosys
146        TCS
147    Infosys
Name: Company, dtype: object